loadtests/artillery/online-session.yml
config:
  target: "{{ $env.TARGET_URL }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 30
      arrivalRate: 0
      name: "Cool down"
  engines:
    socketio-v3:
      path: "/api/game/socket.io"
      transports:
        - websocket
  processor: "./helpers.js"

scenarios:
  - name: "Online session — matchmaking, join and chat"
    engine: socketio-v3
    flow:
      - function: "getAuthToken"
      - connect:
          auth:
            token: "{{ token }}"
      - think: 1

      - emit:
          - "queue:join"
          - boardSize: 5
        response:
          on: "matchmaking:matched"
          capture:
            json: "$.matchId"
            as: "matchId"

      - emit:
          - "match:join"
          - matchId: "{{ matchId }}"
        response:
          on: "session:state"

      - think: 1

      - emit:
          - "chat:message"
          - matchId: "{{ matchId }}"
            text: "loadtest hello"

      - think: 3