loadtests/artillery/turn-timeout.smoke.local.yml
config:
  target: "{{ $env.TARGET_URL }}"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 1
      arrivalCount: 2
      name: "Smoke pair"
  engines:
    socketio-v3:
      path: "/api/game/socket.io"
      transports:
        - websocket
  processor: "./helpers.js"

scenarios:
  - name: "Smoke turn timeout"
    engine: socketio-v3
    flow:
      - function: "getAuthToken"
      - connect:
          path: "/api/game/socket.io"
          transports:
            - websocket
          rejectUnauthorized: false
          auth:
            token: "{{ token }}"

      - emit:
          - "queue:join"
          - boardSize: 5
        response:
          on: "matchmaking:matched"
          capture:
            json: "$.matchId"
            as: "matchId"
          timeout: 10

      - emit:
          - "match:join"
          - matchId: "{{ matchId }}"
        response:
          on: "session:state"
          timeout: 10

      - think: 2

      - emit:
          - "turn:timeout"
          - matchId: "{{ matchId }}"
            version: 0

      - think: 1